Revit 2024 API
BuiltInFailures.FabricSheetFailures.BentFabricSheetTooLongBendingProfile Property
 The bent edge is shorter than the bend profile for this fabric sheet type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetTooLongBendingProfile { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetTooLongBendingProfile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetTooLongBendingProfile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace